       Tran-Rate-Interval.                                              
                                                                        
           String TSQpre,                                               
                  '000V' Delimited By Spaces                            
                  Into WS-TSQname                                       
           Exec Cics ReadQ TS Queue(WS-TSQname)                         
                     Into(WS-OLDV)                                      
                     Item(1)                                            
                     Length(Length of WS-OLDV)                          
                     Resp(WS-RESP)                                      
           End-Exec.                                                    
           If WS-RESP Not = DFHRESP(NORMAL)                             
            Move '120000' To WS-OLDV.                                   
                                                                        
           Exec Cics DeleteQ TS Queue(WS-TSQNAME)                       
                     Resp(WS-RESP)                                      
           End-Exec.                                                    
                                                                        
           Move WS-TIME   To WS-HHMMSS                                  
           Exec Cics WRITEQ TS Queue(WS-TSQNAME)                        
                     FROM(WS-HHMMSS)                                    
                     Length(Length of WS-HHMMSS)                        
                     Resp(WS-RESP)                                      
           End-Exec.                                                    
           Move WS-HH     To HHVal                                      
           Move WS-MM     To MMVal                                      
           Move WS-SS     To SSVal                                      
           Compute NCountVal = (HHVal * 3600) +                         
                               (MMVal * 60)   +                         
                                SSVal                                   
           Move WS-OLDVHH To HHVal                                      
           Move WS-OLDVMM To MMVal                                      
           Move WS-OLDVSS To SSVal                                      
           Compute OCountVal = (HHVal * 3600) +                         
                               (MMVal * 60)   +                         
                                SSVal                                   
           Compute ICountVal = NCountVal - OCountVal                    
           move ICountVal To WS-NEWV                                    
           String TSQpre,                                               
                  '000V' Delimited By Spaces                            
                  Into WS-TSQname                                       
           Exec Cics WRITEQ TS Queue(WS-TSQNAME)                        
                     FROM(WS-NEWV)                                      
                     Length(Length of WS-NEWV)                          
                     Resp(WS-RESP)                                      
           End-Exec.                                                    
           Exec Cics Start Transid('SSST')                              
                     After                                              
                     Minutes(1)                                         
                     Resp(WS-RESP)                                      
           End-Exec.                                                    
                                                                        
           Exit.                                                        
