       MAINLINE SECTION.                                                
                                                                        
      *----------------------------------------------------------------*
      * Common code                                                    *
      *----------------------------------------------------------------*
      * initialize working storage variables                            
           INITIALIZE WS-HEADER.                                        
      * set up general variable                                         
           MOVE EIBTRNID TO WS-TRANSID.                                 
           MOVE EIBTRMID TO WS-TERMID.                                  
           MOVE EIBTASKN TO WS-TASKNUM.                                 
           MOVE SPACES   TO WS-RETRY.                                   
      *----------------------------------------------------------------*
      * initialize DB2 host variables                                   
           INITIALIZE DB2-POLICY.                                       
           INITIALIZE DB2-IN-INTEGERS.                                  
                                                                        
      *----------------------------------------------------------------*
      * Check commarea and obtain required details                     *
      *----------------------------------------------------------------*
      * If NO commarea received issue an ABEND                          
           IF EIBCALEN IS EQUAL TO ZERO                                 
               MOVE ' NO COMMAREA RECEIVED' TO EM-VARIABLE              
               PERFORM WRITE-ERROR-MESSAGE                              
               EXEC CICS ABEND ABCODE('LGCA') NODUMP END-EXEC           
           END-IF                                                       
                                                                        
      * initialize commarea return code to zero                         
           MOVE '00' TO CA-RETURN-CODE                                  
           MOVE EIBCALEN TO WS-CALEN.                                   
           SET WS-ADDR-DFHCOMMAREA TO ADDRESS OF DFHCOMMAREA.           
                                                                        
      * Convert commarea customer & policy nums to DB2 integer format   
           MOVE CA-CUSTOMER-NUM TO DB2-CUSTOMERNUM-INT                  
           MOVE CA-POLICY-NUM   TO DB2-POLICYNUM-INT                    
      * and save in error msg field incase required                     
           MOVE CA-CUSTOMER-NUM TO EM-CUSNUM                            
           MOVE CA-POLICY-NUM   TO EM-POLNUM                            
                                                                        
      *----------------------------------------------------------------*
      * Check which policy type is being requested                     *
      *   and chec commarea length                                     *
      *----------------------------------------------------------------*
                                                                        
      *    Call procedure to update required tables                     
           PERFORM UPDATE-POLICY-DB2-INFO.                              
                                                                        
           EXEC CICS LINK Program(LGUPVS01)                             
                Commarea(DFHCOMMAREA)                                   
                LENGTH(225)                                             
           END-EXEC.                                                    
