       UAD010.

           MOVE 'N' TO COMM-SUCCESS.
      *
      *    Are we trying to transfer from and to the same account?
      *    We don't allow that.
      *
           IF COMM-FACCNO = COMM-TACCNO
              AND COMM-FSCODE = COMM-TSCODE
      *
      *       Preserve the RESP and RESP2, then set up the
      *       standard ABEND info before getting the applid,
      *       date/time etc. and linking to the Abend Handler
      *       program.
      *
              INITIALIZE ABNDINFO-REC
              MOVE EIBRESP    TO ABND-RESPCODE
              MOVE EIBRESP2   TO ABND-RESP2CODE
      *
      *       Get supplemental information
      *
              EXEC CICS ASSIGN APPLID(ABND-APPLID)
              END-EXEC

              MOVE EIBTASKN   TO ABND-TASKNO-KEY
              MOVE EIBTRNID   TO ABND-TRANID

              PERFORM POPULATE-TIME-DATE

              MOVE WS-ORIG-DATE TO ABND-DATE
              STRING WS-TIME-NOW-GRP-HH DELIMITED BY SIZE,
                    ':' DELIMITED BY SIZE,
                    WS-TIME-NOW-GRP-MM DELIMITED BY SIZE,
                    ':' DELIMITED BY SIZE,
                    WS-TIME-NOW-GRP-MM DELIMITED BY SIZE
                    INTO ABND-TIME
              END-STRING

              MOVE WS-U-TIME   TO ABND-UTIME-KEY
              MOVE 'SAME'      TO ABND-CODE

              EXEC CICS ASSIGN PROGRAM(ABND-PROGRAM)
              END-EXEC

              MOVE ZEROS      TO ABND-SQLCODE

              STRING 'UAD010 - Cannot transfer to the same account '
                   DELIMITED BY SIZE,
                   ' EIBRESP=' DELIMITED BY SIZE,
                   ABND-RESPCODE DELIMITED BY SIZE,
                   ' RESP2=' DELIMITED BY SIZE,
                   ABND-RESP2CODE DELIMITED BY SIZE
                   INTO ABND-FREEFORM
              END-STRING

              EXEC CICS LINK PROGRAM(WS-ABEND-PGM)
                       COMMAREA(ABNDINFO-REC)
              END-EXEC

              DISPLAY 'Cannot transfer to the same account'

              EXEC CICS ABEND
                 ABCODE('SAME')
                 NODUMP
                 CANCEL
              END-EXEC

           END-IF.

           IF COMM-FACCNO < COMM-TACCNO
      *
      *       If the FROM account number is less than the TO
      *       account number
      *
              MOVE COMM-FACCNO TO DESIRED-ACC-NO
              MOVE COMM-FSCODE TO DESIRED-SORT-CODE

      *
      *       Update the FROM account
      *
              PERFORM UPDATE-ACCOUNT-DB2-FROM

      *
      *       If the update was successful, update the TO account
      *
              IF COMM-SUCCESS = 'Y'
                 MOVE COMM-TACCNO TO DESIRED-ACC-NO
                 MOVE COMM-TSCODE TO DESIRED-SORT-CODE

                 PERFORM UPDATE-ACCOUNT-DB2-TO

      *
      *          If the update to the TO account was unsuccessful then
      *          we need to flag it and roll it back
      *
                 IF COMM-SUCCESS = 'N'

                    IF COMM-FAIL-CODE = '2'
                       EXEC CICS SYNCPOINT
                          ROLLBACK
                          RESP(WS-CICS-RESP)
                          RESP2(WS-CICS-RESP2)
                       END-EXEC

                       IF WS-CICS-RESP IS NOT EQUAL TO DFHRESP(NORMAL)
      *
      *                   Preserve the RESP and RESP2, then set up the
      *                   standard ABEND info before getting the applid,
      *                   date/time etc. and linking to the Abend
      *                   Handler program.
      *
                          INITIALIZE ABNDINFO-REC
                          MOVE EIBRESP    TO ABND-RESPCODE
                          MOVE EIBRESP2   TO ABND-RESP2CODE
      *
      *                   Get supplemental information
      *
                          EXEC CICS ASSIGN APPLID(ABND-APPLID)
                          END-EXEC

                          MOVE EIBTASKN   TO ABND-TASKNO-KEY
                          MOVE EIBTRNID   TO ABND-TRANID

                          PERFORM POPULATE-TIME-DATE

                          MOVE WS-ORIG-DATE TO ABND-DATE
                          STRING WS-TIME-NOW-GRP-HH DELIMITED BY SIZE,
                             ':' DELIMITED BY SIZE,
                             WS-TIME-NOW-GRP-MM DELIMITED BY SIZE,
                             ':' DELIMITED BY SIZE,
                             WS-TIME-NOW-GRP-MM DELIMITED BY SIZE
                             INTO ABND-TIME
                          END-STRING

                          MOVE WS-U-TIME   TO ABND-UTIME-KEY
                          MOVE 'HROL'      TO ABND-CODE

                          EXEC CICS ASSIGN PROGRAM(ABND-PROGRAM)
                          END-EXEC

                          MOVE ZEROS      TO ABND-SQLCODE

                          STRING 'UAD010(2) - Error on SYNCPOINT'
                             DELIMITED BY SIZE,
                             ' ROLLBACK' DELIMITED BY SIZE,
                             ' after UPDATING TO account '
                             DELIMITED BY SIZE,
                             ' EIBRESP=' DELIMITED BY SIZE,
                             ABND-RESPCODE DELIMITED BY SIZE,
                             ' RESP2=' DELIMITED BY SIZE,
                             ABND-RESP2CODE DELIMITED BY SIZE
                             INTO ABND-FREEFORM
                          END-STRING

                          EXEC CICS LINK PROGRAM(WS-ABEND-PGM)
                             COMMAREA(ABNDINFO-REC)
                          END-EXEC

                          DISPLAY 'XFRFUN error syncpoint rollback'
                             ' after updating TO account '
                             ',RESP=' WS-CICS-RESP
                             ',RESP2=' WS-CICS-RESP2

                          EXEC CICS ABEND
                             ABCODE('HROL')
                             NODUMP
                             CANCEL
                          END-EXEC
                       END-IF

                       GO TO UAD999

                    ELSE
      *
      *                If the COMM-FLAG is anything else other than
      *                2 then abend.
      *
                       DISPLAY 'Error updating TO account'

                       EXEC CICS ABEND
                          ABCODE('TO  ')
                          NODUMP
                       END-EXEC
                    END-IF

                 END-IF

              ELSE
      *
      *          If the update to the FROM account was not successful
      *          rollback.
      *
                 IF COMM-FAIL-CODE = '1'

                    EXEC CICS SYNCPOINT
                       ROLLBACK
                       RESP(WS-CICS-RESP)
                       RESP2(WS-CICS-RESP2)
                    END-EXEC

      *
      *             If the ROLLback failed
      *
                    IF WS-CICS-RESP IS NOT EQUAL TO DFHRESP(NORMAL)
                       DISPLAY 'XFRFUN error syncpoint '
                          ' rollback after '
                          'updating FROM account '
                          ',RESP=' WS-CICS-RESP
                          ',RESP2=' WS-CICS-RESP2

                       EXEC CICS ABEND
                          ABCODE('HROL')
                          NODUMP
                       END-EXEC
                    END-IF

                    GO TO UAD999
                 ELSE
      *
      *             Preserve the RESP and RESP2, then set up the
      *             standard ABEND info before getting the applid,
      *             date/time etc. and linking to the Abend Handler
      *             program.
      *
                    INITIALIZE ABNDINFO-REC
                    MOVE EIBRESP    TO ABND-RESPCODE
                    MOVE EIBRESP2   TO ABND-RESP2CODE
      *
      *             Get supplemental information
      *
                    EXEC CICS ASSIGN APPLID(ABND-APPLID)
                    END-EXEC

                    MOVE EIBTASKN   TO ABND-TASKNO-KEY
                    MOVE EIBTRNID   TO ABND-TRANID

                    PERFORM POPULATE-TIME-DATE

                    MOVE WS-ORIG-DATE TO ABND-DATE
                    STRING WS-TIME-NOW-GRP-HH DELIMITED BY SIZE,
                        ':' DELIMITED BY SIZE,
                        WS-TIME-NOW-GRP-MM DELIMITED BY SIZE,
                        ':' DELIMITED BY SIZE,
                        WS-TIME-NOW-GRP-MM DELIMITED BY SIZE
                        INTO ABND-TIME
                    END-STRING

                    MOVE WS-U-TIME   TO ABND-UTIME-KEY
                    MOVE 'FROM'      TO ABND-CODE

                    EXEC CICS ASSIGN PROGRAM(ABND-PROGRAM)
                    END-EXEC

                    MOVE ZEROS      TO ABND-SQLCODE

                    STRING 'UAD010(3) - Error updating FROM account '
                       DELIMITED BY SIZE,
                       ' EIBRESP=' DELIMITED BY SIZE,
                       ABND-RESPCODE DELIMITED BY SIZE,
                       ' RESP2=' DELIMITED BY SIZE,
                       ABND-RESP2CODE DELIMITED BY SIZE
                       INTO ABND-FREEFORM
                    END-STRING

                    EXEC CICS LINK PROGRAM(WS-ABEND-PGM)
                           COMMAREA(ABNDINFO-REC)
                    END-EXEC

                    DISPLAY 'Error updating FROM account'

                    EXEC CICS ABEND
                       ABCODE('FROM')
                       NODUMP
                       CANCEL
                    END-EXEC

                 END-IF

              END-IF

           ELSE
      *
      *       The FROM account number is greater than the TO
      *       account number
      *
              MOVE COMM-TACCNO TO DESIRED-ACC-NO
              MOVE COMM-TSCODE TO DESIRED-SORT-CODE

      *
      *       Update the TO account number
      *
              PERFORM UPDATE-ACCOUNT-DB2-TO

      *
      *       If the update to the TO account was successful
      *       then update the FROM account
      *
              IF COMM-SUCCESS = 'Y'
                 MOVE COMM-FACCNO TO DESIRED-ACC-NO
                 MOVE COMM-FSCODE TO DESIRED-SORT-CODE

                 PERFORM UPDATE-ACCOUNT-DB2-FROM

      *
      *          Did the update to the FROM account work?
      *
                 IF COMM-SUCCESS = 'N'

                    IF COMM-FAIL-CODE NOT = '1'
      *
      *                Preserve the RESP and RESP2, then set up the
      *                standard ABEND info before getting the applid,
      *                date/time etc. and linking to the Abend Handler
      *                program.
      *
                       INITIALIZE ABNDINFO-REC
                       MOVE EIBRESP    TO ABND-RESPCODE
                       MOVE EIBRESP2   TO ABND-RESP2CODE
      *
      *                Get supplemental information
      *
                       EXEC CICS ASSIGN APPLID(ABND-APPLID)
                       END-EXEC

                       MOVE EIBTASKN   TO ABND-TASKNO-KEY
                       MOVE EIBTRNID   TO ABND-TRANID

                       PERFORM POPULATE-TIME-DATE

                       MOVE WS-ORIG-DATE TO ABND-DATE
                       STRING WS-TIME-NOW-GRP-HH DELIMITED BY SIZE,
                          ':' DELIMITED BY SIZE,
                          WS-TIME-NOW-GRP-MM DELIMITED BY SIZE,
                          ':' DELIMITED BY SIZE,
                          WS-TIME-NOW-GRP-MM DELIMITED BY SIZE
                          INTO ABND-TIME
                       END-STRING

                       MOVE WS-U-TIME   TO ABND-UTIME-KEY
                       MOVE 'FROM'      TO ABND-CODE

                       EXEC CICS ASSIGN PROGRAM(ABND-PROGRAM)
                       END-EXEC

                       MOVE ZEROS      TO ABND-SQLCODE

                       STRING 'UAD010(4) - Error updating FROM account '
                          DELIMITED BY SIZE,
                          ' EIBRESP=' DELIMITED BY SIZE,
                          ABND-RESPCODE DELIMITED BY SIZE,
                          ' RESP2=' DELIMITED BY SIZE,
                          ABND-RESP2CODE DELIMITED BY SIZE
                          INTO ABND-FREEFORM
                       END-STRING

                       EXEC CICS LINK PROGRAM(WS-ABEND-PGM)
                             COMMAREA(ABNDINFO-REC)
                       END-EXEC

                       DISPLAY 'Error updating FROM account'
                       EXEC CICS ABEND
                           ABCODE('FROM')
                           NODUMP
                           CANCEL
                       END-EXEC

                    ELSE
      *
      *                If the FAIL code is something else
      *
                       EXEC CICS SYNCPOINT
                          ROLLBACK
                          RESP(WS-CICS-RESP)
                          RESP2(WS-CICS-RESP2)
                       END-EXEC
      *
      *                If that rollback didn't work
      *
                       IF WS-CICS-RESP IS NOT EQUAL TO DFHRESP(NORMAL)
      *
      *                   Preserve the RESP and RESP2, then set up the
      *                   standard ABEND info before getting the
      *                   applid, date/time etc. and linking to the
      *                   Abend Handler program.
      *
                          INITIALIZE ABNDINFO-REC
                          MOVE EIBRESP    TO ABND-RESPCODE
                          MOVE EIBRESP2   TO ABND-RESP2CODE
      *
      *                   Get supplemental information
      *
                          EXEC CICS ASSIGN APPLID(ABND-APPLID)
                          END-EXEC

                          MOVE EIBTASKN   TO ABND-TASKNO-KEY
                          MOVE EIBTRNID   TO ABND-TRANID

                          PERFORM POPULATE-TIME-DATE

                          MOVE WS-ORIG-DATE TO ABND-DATE
                          STRING WS-TIME-NOW-GRP-HH DELIMITED BY SIZE,
                             ':' DELIMITED BY SIZE,
                              WS-TIME-NOW-GRP-MM DELIMITED BY SIZE,
                              ':' DELIMITED BY SIZE,
                              WS-TIME-NOW-GRP-MM DELIMITED BY SIZE
                              INTO ABND-TIME
                          END-STRING

                          MOVE WS-U-TIME   TO ABND-UTIME-KEY
                          MOVE 'HROL'      TO ABND-CODE

                          EXEC CICS ASSIGN PROGRAM(ABND-PROGRAM)
                          END-EXEC

                          MOVE ZEROS      TO ABND-SQLCODE

                          STRING 'UAD010(5) - Error on SYNCPOINT '
                             DELIMITED BY SIZE,
                             ' ROLLBACK ' DELIMITED BY SIZE,
                             ' after UPDATING the FROM account'
                             DELIMITED BY SIZE,
                             ' EIBRESP=' DELIMITED BY SIZE,
                             ABND-RESPCODE DELIMITED BY SIZE,
                             ' RESP2=' DELIMITED BY SIZE,
                             ABND-RESP2CODE DELIMITED BY SIZE
                             INTO ABND-FREEFORM
                          END-STRING

                          EXEC CICS LINK PROGRAM(WS-ABEND-PGM)
                             COMMAREA(ABNDINFO-REC)
                          END-EXEC

                          DISPLAY 'XFRFUN error syncpoint '
                             ' rollback after '
                             'updating FROM account '
                             ',RESP=' WS-CICS-RESP
                             ',RESP2=' WS-CICS-RESP2

                          EXEC CICS ABEND
                              ABCODE('HROL')
                              NODUMP
                              CANCEL
                          END-EXEC

                       END-IF

                       GO TO UAD999
                    END-IF

                 END-IF

              ELSE

      *
      *          If the update to the TO account was NOT successful
      *          & the fail code isn't = '2'
      *
                 IF COMM-FAIL-CODE NOT = '2'
      *
      *             Preserve the RESP and RESP2, then set up the
      *             standard ABEND info before getting the applid,
      *             date/time etc. and linking to the Abend Handler
      *             program.
      *
                    INITIALIZE ABNDINFO-REC
                    MOVE EIBRESP    TO ABND-RESPCODE
                    MOVE EIBRESP2   TO ABND-RESP2CODE
      *
      *             Get supplemental information
      *
                    EXEC CICS ASSIGN APPLID(ABND-APPLID)
                    END-EXEC

                    MOVE EIBTASKN   TO ABND-TASKNO-KEY
                    MOVE EIBTRNID   TO ABND-TRANID

                    PERFORM POPULATE-TIME-DATE

                    MOVE WS-ORIG-DATE TO ABND-DATE
                    STRING WS-TIME-NOW-GRP-HH DELIMITED BY SIZE,
                       ':' DELIMITED BY SIZE,
                       WS-TIME-NOW-GRP-MM DELIMITED BY SIZE,
                       ':' DELIMITED BY SIZE,
                       WS-TIME-NOW-GRP-MM DELIMITED BY SIZE
                       INTO ABND-TIME
                    END-STRING

                    MOVE WS-U-TIME   TO ABND-UTIME-KEY
                    MOVE 'TO  '      TO ABND-CODE

                    EXEC CICS ASSIGN PROGRAM(ABND-PROGRAM)
                    END-EXEC

                    MOVE ZEROS      TO ABND-SQLCODE

                    STRING 'UAD010(6) - Error updating TO account '
                       DELIMITED BY SIZE,
                       ' EIBRESP=' DELIMITED BY SIZE,
                       ABND-RESPCODE DELIMITED BY SIZE,
                       ' RESP2=' DELIMITED BY SIZE,
                       ABND-RESP2CODE DELIMITED BY SIZE
                       INTO ABND-FREEFORM
                    END-STRING

                    EXEC CICS LINK PROGRAM(WS-ABEND-PGM)
                           COMMAREA(ABNDINFO-REC)
                    END-EXEC

                    DISPLAY 'Error updating TO account'

                    EXEC CICS ABEND
                       ABCODE('TO  ')
                       CANCEL
                       NODUMP
                    END-EXEC
                 ELSE

                    EXEC CICS SYNCPOINT
                       ROLLBACK
                       RESP(WS-CICS-RESP)
                       RESP2(WS-CICS-RESP2)
                    END-EXEC

                    IF WS-CICS-RESP IS NOT EQUAL TO DFHRESP(NORMAL)
      *
      *                Preserve the RESP and RESP2, then set up the
      *                standard ABEND info before getting the applid,
      *                date/time etc. and linking to the Abend Handler
      *                program.
      *
                       INITIALIZE ABNDINFO-REC
                       MOVE EIBRESP    TO ABND-RESPCODE
                       MOVE EIBRESP2   TO ABND-RESP2CODE
      *
      *                Get supplemental information
      *
                       EXEC CICS ASSIGN APPLID(ABND-APPLID)
                       END-EXEC

                       MOVE EIBTASKN   TO ABND-TASKNO-KEY
                       MOVE EIBTRNID   TO ABND-TRANID

                       PERFORM POPULATE-TIME-DATE

                       MOVE WS-ORIG-DATE TO ABND-DATE
                       STRING WS-TIME-NOW-GRP-HH DELIMITED BY SIZE,
                          ':' DELIMITED BY SIZE,
                          WS-TIME-NOW-GRP-MM DELIMITED BY SIZE,
                          ':' DELIMITED BY SIZE,
                          WS-TIME-NOW-GRP-MM DELIMITED BY SIZE
                          INTO ABND-TIME
                       END-STRING

                       MOVE WS-U-TIME   TO ABND-UTIME-KEY
                       MOVE 'HROL'      TO ABND-CODE

                       EXEC CICS ASSIGN PROGRAM(ABND-PROGRAM)
                       END-EXEC

                       MOVE ZEROS      TO ABND-SQLCODE

                       STRING 'UAD010(7) - Error on SYNCPOINT ROLLBACK'
                          DELIMITED BY SIZE,
                          ' after UPDATING the TO account'
                          DELIMITED BY SIZE,
                          ' EIBRESP=' DELIMITED BY SIZE,
                          ABND-RESPCODE DELIMITED BY SIZE,
                          ' RESP2=' DELIMITED BY SIZE,
                          ABND-RESP2CODE DELIMITED BY SIZE
                          INTO ABND-FREEFORM
                       END-STRING

                       EXEC CICS LINK PROGRAM(WS-ABEND-PGM)
                             COMMAREA(ABNDINFO-REC)
                       END-EXEC

                       DISPLAY 'XFRFUN error syncpoint rollback after '
                           'updating TO account '
                           ',RESP=' WS-CICS-RESP
                           ',RESP2=' WS-CICS-RESP2

                       EXEC CICS ABEND
                          ABCODE('HROL')
                          NODUMP
                          CANCEL
                       END-EXEC

                    END-IF

                    GO TO UAD999

                 END-IF

              END-IF

           END-IF.

      *
      *    If the updates to the TO and FROM accounts were successful
      *    then we need to write to PROCTRAN (processed transaction)
      *    to record the successful transfer.
      *
           PERFORM WRITE-TO-PROCTRAN.

           MOVE 'Y' TO COMM-SUCCESS.
